In [1]:
#Импорт биюлилиотек
import os

import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

In [2]:
os.listdir(os.getcwd())

['les_5_hw_2.ipynb',
 'dop_hw',
 'les_5_hw_1.ipynb',
 'les_5_hw_3.ipynb',
 'transaction_data_updated.csv',
 '.ipynb_checkpoints',
 '5_data.csv.zip',
 'transaction_data.csv']

In [3]:
os.getcwd()

'/Users/evgeniyburovik/Documents/Courses/les_5'

In [4]:
os.listdir('/Users/evgeniyburovik/Documents/Courses/les_5/dop_hw')

['tm_sales_1.csv',
 'tm_sales_2.csv',
 'tm_sales_3.csv',
 'prod_activations_logs.csv']

## Загрузка информации

In [5]:
sales_1 = pd.read_csv('/Users/evgeniyburovik/Documents/Courses/les_5/dop_hw/tm_sales_1.csv', sep = ';')

In [6]:
sales_1

     SUBS_ID  FILIAL_ID  PROD_ID          ACT_DTTM
0  id4651830          1     1954  20-03-2020 14:59
1    7646509          5     6431  19-03-2020 13:00
2  id7412683          4     3313  22-03-2020 17:25

In [7]:
sales_2 = pd.read_csv('/Users/evgeniyburovik/Documents/Courses/les_5/dop_hw/tm_sales_2.csv', sep = ';')

In [8]:
sales_2

   FILIAL_ID    SUBS_ID  PROD_ID          ACT_DTTM
0          3  id5416547     1743  17-03-2020 10:17
1          4        NaN     7421  12-03-2020 11:25
2          7    8362218     9879  05-03-2020 11:42
3          2    2185490     3210  16-03-2020 16:28

In [9]:
sales_3 = pd.read_csv('/Users/evgeniyburovik/Documents/Courses/les_5/dop_hw/tm_sales_3.csv', sep = ';')

In [10]:
sales_3

   FILIAL_ID  PROD_ID    SUBS_ID          ACT_DTTM
0          3     1499  id5764122  18-03-2020 15:44
1          6     3020  id7642700  15-03-2020 14:21
2          2     5677  id1374509  17-03-2020 11:48

In [11]:
logs = pd.read_csv('/Users/evgeniyburovik/Documents/Courses/les_5/dop_hw/prod_activations_logs.csv', sep = ';')

In [12]:
logs

     SUBS_ID  PROD_ID        START_DTTM          END_DTTM
1  id4651830     1954  20-03-2020 14:59  01-12-2020 00:00
5  id7646509     6431  19-03-2020 13:00  19-03-2020 13:03
2  id7461794     3310  20-03-2020 17:25  01-12-2020 00:00
3  id5416547     1743  17-03-2020 10:17  25-03-2020 11:00
4  id8238421     1859  01-03-2020 11:42  01-03-2020 11:43
3  id8641743     2752  20-03-2020 15:44  21-04-2020 15:44
2  id2185490     3210  16-03-2020 16:28  01-12-2020 00:00
6  id7642700     3020  15-03-2020 14:21  15-03-2020 23:42
2  id8741631     5677  19-03-2020 12:28  01-12-2020 00:00

In [13]:
sales = pd.concat([sales_1, sales_2, sales_3])

In [14]:
sales

     SUBS_ID  FILIAL_ID  PROD_ID          ACT_DTTM
0  id4651830          1     1954  20-03-2020 14:59
1    7646509          5     6431  19-03-2020 13:00
2  id7412683          4     3313  22-03-2020 17:25
0  id5416547          3     1743  17-03-2020 10:17
1        NaN          4     7421  12-03-2020 11:25
2    8362218          7     9879  05-03-2020 11:42
3    2185490          2     3210  16-03-2020 16:28
0  id5764122          3     1499  18-03-2020 15:44
1  id7642700          6     3020  15-03-2020 14:21
2  id1374509          2     5677  17-03-2020 11:48

In [15]:
sales.dtypes

SUBS_ID      object
FILIAL_ID     int64
PROD_ID       int64
ACT_DTTM     object
dtype: object

In [16]:
sales = sales.dropna(subset = ['SUBS_ID'])

In [17]:
def convert_id(string):
    if string.startswith('id'):
        return string
    return 'id'+string

In [18]:
id_demo = 'id8362218'
id_demo = convert_id(id_demo)

In [19]:
print(id_demo)

id8362218

In [20]:
sales['SUBS_ID'] = sales['SUBS_ID'].apply(convert_id)

<ipython-input-20-7f3a85fa191d>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sales['SUBS_ID'] = sales['SUBS_ID'].apply(convert_id)

In [21]:
sales

     SUBS_ID  FILIAL_ID  PROD_ID          ACT_DTTM
0  id4651830          1     1954  20-03-2020 14:59
1  id7646509          5     6431  19-03-2020 13:00
2  id7412683          4     3313  22-03-2020 17:25
0  id5416547          3     1743  17-03-2020 10:17
2  id8362218          7     9879  05-03-2020 11:42
3  id2185490          2     3210  16-03-2020 16:28
0  id5764122          3     1499  18-03-2020 15:44
1  id7642700          6     3020  15-03-2020 14:21
2  id1374509          2     5677  17-03-2020 11:48

In [22]:
logs

     SUBS_ID  PROD_ID        START_DTTM          END_DTTM
1  id4651830     1954  20-03-2020 14:59  01-12-2020 00:00
5  id7646509     6431  19-03-2020 13:00  19-03-2020 13:03
2  id7461794     3310  20-03-2020 17:25  01-12-2020 00:00
3  id5416547     1743  17-03-2020 10:17  25-03-2020 11:00
4  id8238421     1859  01-03-2020 11:42  01-03-2020 11:43
3  id8641743     2752  20-03-2020 15:44  21-04-2020 15:44
2  id2185490     3210  16-03-2020 16:28  01-12-2020 00:00
6  id7642700     3020  15-03-2020 14:21  15-03-2020 23:42
2  id8741631     5677  19-03-2020 12:28  01-12-2020 00:00

In [23]:
sales_log = sales.merge(logs, how = 'inner', on = ['SUBS_ID', 'PROD_ID'])

In [24]:
sales_log

,SUBS_ID,FILIAL_ID,PROD_ID,ACT_DTTM,START_DTTM,END_DTTM
0,id4651830,1,1954,20-03-2020 14:59,20-03-2020 14:59,01-12-2020 00:00
1,id7646509,5,6431,19-03-2020 13:00,19-03-2020 13:00,19-03-2020 13:03
2,id5416547,3,1743,17-03-2020 10:17,17-03-2020 10:17,25-03-2020 11:00
3,id2185490,2,3210,16-03-2020 16:28,16-03-2020 16:28,01-12-2020 00:00
4,id7642700,6,3020,15-03-2020 14:21,15-03-2020 14:21,15-03-2020 23:42

In [25]:
sales_log['START_DTTM']= pd.to_datetime(sales_log['START_DTTM'], format='%d-%m-%Y %H:%M')
sales_log['END_DTTM']= pd.to_datetime(sales_log['END_DTTM'], format='%d-%m-%Y %H:%M')

In [26]:
sales_log.dtypes

SUBS_ID               object
FILIAL_ID              int64
PROD_ID                int64
ACT_DTTM              object
START_DTTM    datetime64[ns]
END_DTTM      datetime64[ns]
dtype: object

In [27]:
sales_log['difference'] =  sales_log['END_DTTM'] - sales_log['START_DTTM']

In [28]:
sales_log[sales_log.difference > '5m'].sort_values('SUBS_ID').SUBS_ID.tolist()

['id2185490', 'id4651830', 'id5416547', 'id7642700']